# 對照AI範例用的空白練習檔案
# 只看題目在此區作答，不要看AI的答案
# =================================================================================================

# AI_ex01:輸出字串
# 試著利用print函數在螢幕上輸出文字"Hello World"

print("Hello World!")
print("Hello","World!")
print("Hello"+"World!")



# AI_ex02:變數指派
# 試著宣告兩個整數變數a和b，並分別指定值為10和20
# 將a和b相加的結果儲存到變數sum_ab中
# 印出sum_ab的值


ex02_a = 10
ex02_b = 20
ex02_sum_ab = ex02_a + ex02_b

print(ex02_sum_ab)






# AI_ex03:輸入與型別轉換
# 利用input函數輸入數值，並儲存到變數str_age中
# 將str_age轉換為整數並儲存到變數age中，再印出age的值






# AI_ex04:整數除法與求餘數
# 試著宣告一個整數變數，並分別使用 "//"、"%" 運算子計算其平方根的整數部分以及餘數
# 將結果分別儲存到 sqrt_ab 和 remainder 兩個變數中，並輸出其值






# AI_ex05:條件判斷 (if-elif-else)
# 提示入一個整數，再輸出判斷是奇數、偶數或0







# AI_ex06:成績統計
# 提示輸入整數分數，分別為國文、英文、數學
# 分數範圍為0~100，若分數大於100或小於0，則輸出“輸入錯誤”
# 若輸入正確則輸出"總分"、"平均"、"最高分"、"最低分" 





